Tekla Open API Reference for Tekla Structures 2025
Identifier.ID2 Property
 The sub identifier number. If the subID value is set manually, the GUID is initialized to Guid.Empty and the identification is done based on the ID.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int ID2 { get; set; }
Public Property ID2 As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Identifier Class
Tekla.Structures Namespace